In [1]:
import pandas as pd

In [2]:
emp = pd.read_csv("emp.csv")

In [3]:
dept = pd.read_csv("dept.csv")

# Select Statement

Display the details of all employees

SQl> select * from emp

In [4]:
#pandas equivalent
emp

,emp_id,emp_name,job_name,manager_id,hire_date,salary,commission,dept_id
0,68319,KAYLING,PRESIDENT,NaN,18-11-1991,6000,NaN,1001
1,66928,BLAZE,MANAGER,68319.0,01-05-1991,2750,NaN,3001
2,67832,CLARE,MANAGER,68319.0,09-06-1991,2550,NaN,1001
3,65646,JONAS,MANAGER,68319.0,02-04-1991,2957,NaN,2001
4,67858,SCARLET,ANALYST,65646.0,19-04-1997,3100,NaN,2001
5,69062,FRANK,ANALYST,65646.0,03-12-1991,3100,NaN,2001
6,63679,SANDRINE,CLERK,69062.0,18-12-1990,900,NaN,2001
7,64989,ADELYN,SALESMAN,66928.0,20-02-1991,1700,400.0,3001
8,65271,WADE,SALESMAN,66928.0,22-02-1991,1350,600.0,3001
9,66564,MADDEN,SALESMAN,66928.0,28-09-1991,1350,1500.0,3001
10,68454,TUCKER,SALESMAN,66928.0,08-09-1991,1600,0.0,3001
11,68736,ADNRES,CLERK,67858.0,23-05-1997,1200,NaN,2001
12,69000,JULIUS,CLERK,66928.0,03-12-1991,1050,NaN,3001
13,69324,MARKER,CLERK,67832.0,23-01-1992,1400,NaN,1001

Select department details

SQL> select * from dept

In [5]:
#pandas equivalent
dept

   dept_id   dept_name  dept_loc
0     1001  ACCOUNTING  NEW YORK
1     2001    RESEARCH    DALLAS
2     3001       SALES   CHICAGO
3     4001  OPERATIONS    BOSTON

# Select statement with particular columns

Select the name and salary of all employees

SQL> select name, salary from emp

In [6]:
#pandas equivalent
emp[['emp_name','salary']] #specify list of column names needed in square brackets

    emp_name  salary
0    KAYLING    6000
1      BLAZE    2750
2      CLARE    2550
3      JONAS    2957
4    SCARLET    3100
5      FRANK    3100
6   SANDRINE     900
7     ADELYN    1700
8       WADE    1350
9     MADDEN    1350
10    TUCKER    1600
11    ADNRES    1200
12    JULIUS    1050
13    MARKER    1400

Select the department name and respective locations

SQL> select dept_name, dept_loc from dept

In [7]:
#pandas equivalent
dept[['dept_name','dept_loc']] #specify list of column names needed in square brackets

    dept_name  dept_loc
0  ACCOUNTING  NEW YORK
1    RESEARCH    DALLAS
2       SALES   CHICAGO
3  OPERATIONS    BOSTON

# Where Clause

select employee names working for dept number 1001

SQL> select emp_name from dept where dept_id = 1001

In [8]:
#pandas equivalent
emp.loc[emp['dept_id'] == 1001,['emp_name']]

   emp_name
0   KAYLING
2     CLARE
13   MARKER

# Aggregate functions

Count()

Sum()

Avg()

Min()

Max()

Display the number of employees

SQL> select count(*) from emp

In [9]:
#pandas equivalent
print(len(emp))
#or 
print(emp.shape[0])

14
14

Display the sum of salaries

SQL> select sum(salary) from emp

In [10]:
#pandas equivalent
emp['salary'].sum()

31007

Display the average salary

SQL> select avg(salary) from emp

In [11]:
#pandas equivalent
emp['salary'].mean()

2214.785714285714

Display the minimum salary

SQL> select min(salary) from emp

In [12]:
#pandas equivalent
emp['salary'].min()

900

Display the maximum salary

SQL> select max(salary) from emp

In [13]:
#pandas equivalent
emp['salary'].max()

6000

# Group by clause

Display job names and their respective number of employees

SQL> select job_name, sum(*) from emp group by job_name

In [14]:
#pandas equivalent
emp[['job_name','salary']].groupby(['job_name']).aggregate(['sum']).droplevel(1,axis=1).reset_index()

    job_name  salary
0    ANALYST    6200
1      CLERK    4550
2    MANAGER    8257
3  PRESIDENT    6000
4   SALESMAN    6000

# Having Clause

select job names with sum of salaries is greater then 6000

SQL> select job_name, sum(salary) from emp group by job_name having sum(salary)>6000

In [15]:
#pandas equivalent
grp_by = emp[['job_name','salary']].groupby(['job_name']).aggregate(['sum']).droplevel(1,axis=1).reset_index()
grp_by[grp_by['salary'] >6000]

  job_name  salary
0  ANALYST    6200
2  MANAGER    8257

# Order by  Clause

select job names and thier respective sum of salaries in their increasing order of salaries

SQL> select job_name, sum(salary) from emp group by salary order by salary asc

In [16]:
#pandas equivalent
grp_by = emp[['job_name','salary']].groupby(['job_name']).agg([sum]).reset_index()
grp_by = grp_by.droplevel(1, axis =1)
grp_by.sort_values(['salary'],ascending = False)

    job_name  salary
2    MANAGER    8257
0    ANALYST    6200
3  PRESIDENT    6000
4   SALESMAN    6000
1      CLERK    4550

select job names and thier respective sum of salaries in their alphabetical order of job names 

SQL> select job_name, sum(salary) from emp group by salary order by job_name desc

In [17]:
#pandas equivalent
grp_by = emp[['job_name','salary']].groupby(['job_name']).agg([sum]).reset_index()
grp_by = grp_by.droplevel(1, axis =1)
grp_by.sort_values(['job_name']) # by default ascending = True

    job_name  salary
0    ANALYST    6200
1      CLERK    4550
2    MANAGER    8257
3  PRESIDENT    6000
4   SALESMAN    6000